# InfrastructureAlignmentDescription Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..InfrastructureAlignmentDescription Property
ParameterTypeId Class See Also
---
"Description"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId InfrastructureAlignmentDescription { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property InfrastructureAlignmentDescription As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ InfrastructureAlignmentDescription {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace